notes/meeting_2022apr24.org
* meeting notes April 24, 2022
** the raku study group
*** usual links
**** these notes
***** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022apr24.md
**** code examples
***** https://github.com/doomvox/raku-study/tree/main/bin/2022apr24

** the new "darkroast" project
*** https://github.com/doomvox/darkroast

** rob ransbottom
*** https://theweeklychallenge.org/


** bill michaels
*** https://unix.stackexchange.com/a/699417/227738 
*** https://stackoverflow.com/a/71973303/7270649 
*** https://stackoverflow.com/a/71989016/7270649  
*** https://unix.stackexchange.com/a/699338/227738 
*** https://corky.net/dotan/log/2009/06/heres-why-people-hate-perl-folks.html 


**** move/copy command in Raku doesn't work with directory as second arg
***** https://stackoverflow.com/questions/71909580/move-function-does-not-work-in-raku-in-windows/71973303#71973303

raku -e 'for dir(test => / .+ \.txt /) {.say};'
"persons.txt".IO
"time.txt".IO

raku -e 'mkdir IO::Path.new("../dest");'

raku -e 'for dir(test => / .+ \.txt $ /) { copy $_, "../dest/$_", createonly => True};'

ls ../dest
persons.txt time.txt

***** https://docs.raku.org/routine/move

To avoid copying, you can use rename, if the files are on the same
storage device. It also works with directories, while move does not.

****** Seriously?


** earlier weekly challenge: "four is magic", bruce gray
*** https://theweeklychallenge.org/blog/perl-weekly-challenge-160/
*** https://github.com/manwar/perlweeklychallenge-club/tree/master/challenge-160/bruce-gray/raku
*** http://blogs.perl.org/users/bruce_gray/2022/04/twc-160-mysticmath-balance.html

** postponed from previous meetings
*** an answer to what's Raku for:
**** https://www.codesections.com/blog/raku-manifesto/


** earlier topics, follow-up some time:
*** gui toolkits
**** gtk3
***** marcel timmerman on raku
***** https://modules.raku.org/dist/Gnome::Gtk3
***** https://github.com/MARTIMM/gnome-gtk3/issues/28#issue-1199187148 
**** iup
***** https://en.wikipedia.org/wiki/IUP_(software)
***** https://raku.land/github:hankache/IUP
**** wish based tk 


** untopics

** announcements 
*** May 8th: next raku study group meeting 
*** June 21-25: tprc: perl/raku conference 
